<?php

return [
    'subscription_payment_status' => [
        'completed' => [
            'title' =>  'تم تأكيد عملية الدفع الخاصة بك',
            'description' =>  'مبروك! تم تأكيد عملية الدفع للإشتراك الخاص بك',
        ],
        'canceled' => [
            'title' =>  'تم إلغاء عملية الدفع الخاصة بك',
            'description' =>  'للأسف! تم إلغاء عملية الدفع للإشتراك الخاص بك',
        ],
        'on_hold' => [
            'title' =>  'تم تعليق عملية الدفع الخاصة بك',
            'description' =>  'سيتم إشعاركم فور تأكيد عملية الدفع',
        ],
        'failed' => [
            'title' =>  'فشلت عملية الدفع الخاصة بك',
            'description' =>  'للأسف! فشلت عملية الدفع للإشتراك الخاص بك',
        ],
        'in_review' => [
            'title' =>  'عملية دفع لإشتراك بإنتظار التأكيد',
            'description' =>  'يوجد عملية دفع لإشتراك بإنتظار التأكيد',
        ]
    ]
];
